[
  {
    "genres": "Amazing",
    "fact_no": "1",
    "fact": "3.34 m is the recorded height of the tallest basil plant."
  },
  {
    "genres": "Amazing",
    "fact_no": "2",
    "fact": "Ginkgo Biloba is one of the oldest tree species that is alive."
  },
  {
    "genres": "Amazing",
    "fact_no": "3",
    "fact": "The leaves of the Lucky Bamboo plant grow up to one inch per month."
  },
  {
    "genres": "Amazing",
    "fact_no": "4",
    "fact": "Cucumber is a fruit and not a vegetable because it has seeds inside."
  },
  {
    "genres": "Amazing",
    "fact_no": "5",
    "fact": "A Money plant also has seeds. The seeds grow inside the pods, enlarge, and burst fall on the ground."
  },
  {
    "genres": "Interesting",
    "fact_no": "6",
    "fact": "Banana is actually an Arabic word for fingers."
  },
  {
    "genres": "Interesting",
    "fact_no": "7",
    "fact": "Many plants are carnivores like the Venus Flytrap and eat tiny little insects and spiders to gain useful nutrients."
  },
  {
    "genres": "Interesting",
    "fact_no": "8",
    "fact": "There are more than 300,000 plant species identified till date and the list is constantly expanding."
  },
  {
    "genres": "Interesting",
    "fact_no": "9",
    "fact": "Oak trees do not produce acorns until they become 50 years old."
  },
  {
    "genres": "Interesting",
    "fact_no": "10",
    "fact": "Avocados and tomatoes are actually fruits."
  },
  {
    "genres": "Interesting",
    "fact_no": "11",
    "fact": "More than 20% of the world’s oxygen supply is produced by the Amazon Rainforest."
  },
  {
    "genres": "Interesting",
    "fact_no": "12",
    "fact": "Dandelion can be eaten whole, right from its roots up to the petals."
  },
  {
    "genres": "Knowledge",
    "fact_no": "13",
    "fact": "Apple’s volume consists of 25% air which is why it floats on water."
  },
  {
    "genres": "Knowledge",
    "fact_no": "14",
    "fact": "More than 85% of plant life is found in the ocean."
  },
  {
    "genres": "Knowledge",
    "fact_no": "15",
    "fact": "The first potatoes were cultivated in Peru about 7000 years ago."
  },
  {
    "genres": "Knowledge",
    "fact_no": "16",
    "fact": "The country Brazil is named after a tree."
  },
  {
    "genres": "Knowledge",
    "fact_no": "17",
    "fact": "Plant roots are covered with root hairs that are used to absorb minerals and water."
  },
  {
    "genres": "Knowledge",
    "fact_no": "18",
    "fact": "Water travels in the upward direction from the roots to its stem and then into the plant leaves."
  },
  {
    "genres": "Knowledge",
    "fact_no": "19",
    "fact": "Strawberry is the only fruit that has seeds on the outside. It has about an average of 200 seeds."
  },
  {
    "genres": "Knowledge",
    "fact_no": "20",
    "fact": "96% of raw cucumber and 84% of a raw apple is water."
  }
]